/*
 * Copyright 2004-2011 Freescale Semiconductor, Inc. All Rights Reserved.
 */

/*
 * The code contained herein is licensed under the GNU General Public
 * License. You may obtain a copy of the GNU General Public License
 * Version 2 or later at the following locations:
 *
 * http://www.opensource.org/licenses/gpl-license.html
 * http://www.gnu.org/copyleft/gpl.html
 */

/*!
 * @file adv7842pal.c
 *
 * @brief adv7842pal camera driver functions
 *
 * @ingroup Camera
 */

#include <linux/module.h>
#include <linux/init.h>
#include <linux/types.h>
#include <linux/delay.h>
#include <linux/device.h>
#include <linux/i2c.h>
#include <linux/videodev2.h>
#include <linux/regulator/consumer.h>
#include <linux/fsl_devices.h>
#include <media/v4l2-chip-ident.h>
#include <media/v4l2-int-device.h>
#include "mxc_v4l2_capture.h"

static struct regulator *dvddio_regulator;
static struct regulator *dvdd_regulator;
static struct regulator *avdd_regulator;
static struct regulator *pvdd_regulator;
static struct fsl_mxc_tvin_platform_data *tvin_plat;

/*!
 * Holds the current frame rate.
 */

struct sensor {
	struct sensor_data sen;
	v4l2_std_id std_id;
	struct i2c_client *i2c_sdp; //0x90
	struct i2c_client *i2c_sdp_io; //0x94
	struct i2c_client *i2c_avlink; //0x84
	struct i2c_client *i2c_cp; //0x44
	struct i2c_client *i2c_vdp; //0x48
	struct i2c_client *i2c_afe; //0x4c
	struct i2c_client *i2c_hdmi; //0x68
	struct i2c_client *i2c_ksv; //0x64
	struct i2c_client *i2c_edid; //0x6c
	struct i2c_client *i2c_infoframe; //0x7c
	struct i2c_client *i2c_cec; //0x80
} adv7842_pal;

/*! List of input video formats supported. The video formats is corresponding
 * with v4l2 id in video_fmt_t
 */
typedef enum {
	ADV7842_NTSC = 0, /*!< Locked on (M) NTSC video signal. */
	ADV7842_PAL, /*!< (B, G, H, I, N)PAL video signal. */
	ADV7842_NOT_LOCKED, /*!< Not locked on a signal. */
} video_fmt_idx;

/*! Number of video standards supported (including 'not locked' signal). */
#define ADV7842_STD_MAX (ADV7842_PAL + 1)

/*! Video format structure. */
typedef struct {
	int v4l2_id; /*!< Video for linux ID. */
	char name[16]; /*!< Name (e.g., "NTSC", "PAL", etc.) */
	u16 raw_width; /*!< Raw width. */
	u16 raw_height; /*!< Raw height. */
	u16 active_width; /*!< Active width. */
	u16 active_height; /*!< Active height. */
} video_fmt_t;

/*! Description of video formats supported.
 *
 *  PAL: raw=720x625, active=720x576.
 *  NTSC: raw=720x525, active=720x480.
 */
static video_fmt_t video_fmts[] = {
	{
		/*! (B, G, H, I, N) PAL */
